src/InformationRegisters/ОтметкиВремениИзмененияСведенийПисем/ОтметкиВремениИзмененияСведенийПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтметкиВремениИзмененияСведенийПисем</name>
  <dimensions>
    <name>Граница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ОтметкиВремениИзмененияСведенийПисем/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ДобавитьЗапись(УчетнаяЗапись, Письмо) Экспорт
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Отбор.Письмо.Установить(Письмо);
	
	МЗ = НЗ.Добавить();
	МЗ.УчетнаяЗапись = УчетнаяЗапись;
	МЗ.Письмо = Письмо;
	МЗ.Граница = ТекущаяУниверсальнаяДатаВМиллисекундах();
	НЗ.Записать();
	
КонецПроцедуры

#КонецЕсли
